[
{"term": "A port-based authentication protocol. Wireless can use 802.1X. For example, WPA2-Enterprise mode uses an 802.1X server (implemented as a RADIUS server) to add authentication.", "acronym": "802.1x"},
{"term": "Triple Digital Encryption Standard. A symmetric algorithm used to encrypt data and provide confidentiality. It was originally designed as a replacement for DES. It uses multiple keys and multiple passes and is not as efficient as AES, but is still used in some applications, such as when hardware doesn’t support AES.", "acronym": "3DES"},
{"term": "Authentication, Authorization, and Accounting. AAA protocols are used in remote access systems. For example, TACACS+ is an AAA protocol that uses multiple challenges and responses during a session. Authentication verifies a user’s identification. Authorization determines if a user should have access. Accounting tracks a user’s access with logs.", "acronym": "AAA"},
{"term": "Access Control Entry. Identifies a user or group that is granted permission to a resource. ACEs are contained within a DACL in NTFS.", "acronym": "ACE"},
{"term": "Access control list. A list of rules used to grant access to a resource. In NTFS, a list of ACEs makes up the ACL for a resource. In a firewall, an ACL identifies traffic that is allowed or blocked based on IP addresses, networks, ports, and some protocols (using the protocol ID).", "acronym": "ACL"},
{"term": "Advanced Encryption Standard. A symmetric algorithm used to encrypt data and provide confidentiality. AES is quick, highly secure, and used in a wide assortment of cryptography schemes. It includes key sizes of 128 bits, 192 bits, or 256 bits.", "acronym": "AES"},
{"term": "Advanced Encryption Standard 256 bit. AES sometimes includes the number of bits used in the encryption keys and AES256 uses 256-bit encryption keys.", "acronym": "AES256"},
{"term": "Authentication Header. IPsec includes both AH and ESP. AH provides authentication and integrity, and ESP provides confidentiality, integrity, and authentication. AH is identified with protocol ID number 51.", "acronym": "AH"},
{"term": "Annualized loss expectancy. Used to measure risk with annualized rate of occurrence (ARO) and single loss expectancy (SLE). The ALE identifies the total amount of loss expected for a given risk. The calculation is SLE x ARO = ALE.", "acronym": "ALE"},
{"term": "Access point, short for wireless access point (WAP). APs provide access to a wired network to wireless clients. Many APs support isolation mode to segment wireless uses from other wireless users.", "acronym": "AP"},
{"term": "Annualized rate of occurrence. Used to measure risk with annualized loss expectancy (ALE) and single loss expectancy (SLE). The ARO identifies how many times a loss is expected to occur in a year. The calculation is SLE x ARO = ALE.", "acronym": "ARO"},
{"term": "Address Resolution Protocol. Resolves IP addresses to MAC addresses. ARP poisoning attacks can redirect traffic through an attacker’s system by sending false MAC address updates. VLAN segregation helps prevent the scope of ARP poisoning attacks within a network.", "acronym": "ARP"},
{"term": "Acceptable use policy. An AUP defines proper system usage. It will often describe the purpose of computer systems and networks, how users can access them, and the responsibilities of users when accessing the systems.", "acronym": "AUP"},
{"term": "Business continuity plan. A plan that helps an organization predict and plan for potential outages of critical services or functions. It includes disaster recovery elements that provide the steps used to return critical functions to operation after an outage. A BIA is a part of a BCP and the BIA drives decisions to create redundancies such as failover clusters or alternate sites.", "acronym": "BCP"},
{"term": "Business impact analysis. The BIA identifies critical business or mission requirements and includes elements such as Recovery Time Objectives (RTOs) and Recovery Point Objectives (RPOs), but it doesn’t identify solutions.", "acronym": "BIA"},
{"term": "Basic Input/Output System. A computer’s firmware used to manipulate different settings such as the date and time, boot drive, and access password.", "acronym": "BIOS"},
{"term": "Network Robots. An automated program or system used to perform one or more tasks. A malicious botnet is group of computers called zombies and controlled through a command-and-control server. Attackers use malware to join computers to botnets. Zombies regularly check in with the command-and-control server and can launch DDoS attacks against other victims. Botnet activity often includes hundreds of outbound connections, and some botnets use Internet Relay Chat (IRC) channels.", "acronym": "BOTS"},
{"term": "Certificate Authority. An organization that manages, issues, and signs certificates and is part of a PKI. Certificates are an important part of asymmetric encryption. Certificates include public keys along with details on the owner of the certificate and on the CA that issued the certificate. Certificate owners share their public key by sharing a copy of their certificate.", "acronym": "CA"},
{"term": "Common Access Card. A specialized type of smart card used by United States Department of Defense. It includes photo identification and provides confidentiality, integrity, authentication, and non-repudiation for the users. It is similar to a PIV.", "acronym": "CAC"},
{"term": "Controller Area Network. A standard that allows microcontrollers and devices to communicate with each other without a host computer.", "acronym": "CAN"},
{"term": "Counter Mode with Cipher Block Chaining Message Authentication Code Protocol. An encryption protocol based on AES used with WPA2 for wireless security. It is more secure then TKIP, used with the original release of WPA.", "acronym": "CCMP"},
{"term": "Closed-circuit television. This is a detective control that provides video surveillance. Video surveillance provides reliable proof of a person’s location and activity. It can be used by an organization to verify if any equipment or data is being removed.", "acronym": "CCTV"},
{"term": "Computer Emergency Response Team. A group of experts that respond to security incidents. Also known as CIRT, SIRT, or IRT.", "acronym": "CERT"},
{"term": "Challenge Handshake Authentication Protocol. Authentication mechanism where a server challenges a client. MS-CHAPv2 is an improvement over CHAP and uses mutual authentication.", "acronym": "CHAP"},
{"term": "Confidentiality, integrity, and availability. These three form the security triad. Confidentiality helps prevent the unauthorized disclosure of data. Integrity provides assurances that data has not been modified, tampered with, or corrupted. Availability indicates that data and services are available when needed.", "acronym": "CIA"},
{"term": "Computer Incident Response Team. A group of experts that respond to security incidents. Also known as CERT, SIRT, or IRT.", "acronym": "CIRT"},
{"term": "Continuity of Operations Plan. A COOP site provides an alternate location for operations after a critical outage. A hot site includes personnel, equipment, software, and communications capabilities of the primary site with all the data up to date. A hot site can take over for a failed primary site within an hour. A cold site will have power and connectivity needed for COOP activation, but little else. A warm site is a compromise between a hot site and a cold site.", "acronym": "COOP"},
{"term": "Cyclical Redundancy Check. An error detection code used to detect accidental changes that can affect the integrity of data.", "acronym": "CRC"},
{"term": "Certification Revocation List. A list of certificates that have been revoked. Certificates are commonly revoked if they are compromised. The certificate authority (CA) that issued the certificate publishes a CRL, and a CRL is public.", "acronym": "CRL"},
{"term": "Discretionary Access Control. An access control model where all objects have owners and owners can modify permissions for the objects (files and folders). Microsoft’s NTFS uses the DAC model. Other access control models are MAC and RBAC.", "acronym": "DAC"},
{"term": "Discretionary Access Control List. List of Access Control Entries (ACEs) in Microsoft’s NTFS. Each ACE includes a security identifier (SID) and a permission.", "acronym": "DACL"},
{"term": "Distributed denial-of-service. An attack on a system launched from multiple sources intended to make a computer’s resources or services unavailable to users. DDoS attacks are often launched from zombies in botnets. DDoS attacks typically include sustained, abnormally high network traffic. A performance baseline helps administrators detect a DDoS. Compare to DoS.", "acronym": "DDoS"},
{"term": "Data Execution Prevention. A security feature in some operating systems. It helps prevent an application or service from executing code from a nonexecutable memory region", "acronym": "DEP"},
{"term": "Digital Encryption Standard. An older symmetric encryption standard used to provide confidentiality. DES uses 56 bits and is considered cracked.", "acronym": "DES"},
{"term": "Dynamic Host Configuration Protocol. A service used to dynamically assign TCP/IP configuration information to clients. DHCP is often used to assign IP addresses, subnet masks, default gateways, DNS server addresses, and much more.", "acronym": "DHCP"},
{"term": "Dynamic Link Library. A compiled set of code that can be called from other programs.", "acronym": "DLL"},
{"term": "Data Loss Protection. A network-based DLP system can examine and analyze network traffic. It can detect if confidential company data or any PII data is included in e-mail and reduce the risk of internal users e-mailing sensitive data outside the organization.", "acronym": "DLP"},
{"term": "Demilitarized zone. Area between two firewalls separating the Internet and an internal network. A DMZ provides a layer of protection for Internet-facing servers. It allows access to a server or service for Internet users while segmenting and protecting access to the internal network.", "acronym": "DMZ"},
{"term": "Domain Name System. Used to resolve host names to IP addresses. DNS is the primary name resolution service used on the Internet and is also used on internal networks. DNS uses port 53. DNS poisoning attempts to modify or corrupt cached DNS results. A pharming attack is a specific type of DNS poisoning attack that redirects a website’s traffic to another website.", "acronym": "DNS"},
{"term": "Denial-of-service. An attack from a single source that attempts to disrupt the services provided by another system. Examples include SYN flood, smurf, and some buffer overflow attacks. Compare to DDoS.", "acronym": "DoS"},
{"term": "Disaster recovery plan. A document designed to help a company respond to disasters, such as hurricanes, floods, and fires. It includes a hierarchical list of critical systems and often prioritizes services to restore after an outage. Testing validates the plan. Recovered systems are tested before returning them to operation, and this can include a comparison to baselines. The final phase of disaster recovery includes a review to identify any lessons learned and may include an update of the plan.", "acronym": "DRP"},
{"term": "Digital Signature Algorithm. A digital signature is an encrypted hash of a message. The sender’s private key encrypts the hash of the message to create the digital signature. The recipient decrypts the hash with the sender’s public key, and, if successful, it provides authentication, non-repudiation, and integrity. Authentication identifies the sender. Integrity verifies the message has not been modified. Non-repudiation is used with online transactions and prevents the sender from later denying they sent the e-mail.", "acronym": "DSA"},
{"term": "Extensible Authentication Protocol. An authentication framework that provides general guidance for authentication methods. Variations include LEAP and PEAP", "acronym": "EAP"},
{"term": "Elliptic curve cryptography. An asymmetric encryption algorithm commonly used with smaller wireless devices. It uses smaller key sizes and requires less processing power than many other encryption methods", "acronym": "ECC"},
{"term": "Encrypting File System. A feature within NTFS on Windows systems that supports encrypting individual files or folders for confidentiality.", "acronym": "EFS"},
{"term": "Electromagnetic interference. Interference caused by motors, power lines, and fluorescent lights. Cables can be shielded to protect signals from EMI. Additionally, EMI shielding prevents signal emanation, so it can prevent someone from capturing network traffic.", "acronym": "EMI"},
{"term": "Encapsulating Security Protocol. IPsec includes both AH and ESP. AH provides authentication and integrity, and ESP provides confidentiality, integrity, and authentication. ESP is identified with protocol ID number 50.", "acronym": "ESP"},
{"term": "File Transfer Protocol. Used to upload and download files to an FTP server. FTP uses ports 20 and 21. Secure FTP (SFTP) uses SSH for encryption on port 22. FTP Secure (FTPS) uses SSL or TLS for encryption.", "acronym": "FTP"},
{"term": "File Transfer Protocol Secure. An extension of FTP that uses SSL or TLS to encrypt FTP traffic. Some implementations of FTPS use ports 989 and 990.", "acronym": "FTPS"},
{"term": "GNU Privacy Guard (GPG). Free software that is based on the OpenPGP standard. It is similar to PGP but avoids any conflict with existing licensing by using open standards.", "acronym": "GPG"},
{"term": "Group Policy object. Group Policy is used within Microsoft Windows to manage users and computers. It is implemented on a domain controller within a domain. Administrators use it to create password policies, lock down the GUI, configure host-based firewalls, and much more.", "acronym": "GPO"},
{"term": "Global Positioning System. GPS tracking can help locate lost mobile devices. Remote wipe, or remote sanitize, erases all data on lost devices. Full disk encryption protects the data on the device if it is lost.", "acronym": "GPS"},
{"term": "Generic Routing Encapsulation. A tunneling protocol developed by Cisco Systems.", "acronym": "GRE"},
{"term": "Graphical user interface. Users interact with the graphical elements instead of typing in commands from a text interface. Windows is an example of a GUI.", "acronym": "GUI"},
{"term": "Hard disk drive. A disk drive that has one or more platters and a spindle. In contrast, USB flash drives use flash memory.", "acronym": "HDD"},
{"term": "Host-based intrusion detection system. An IDS used to monitor an individual server or workstation. It protects local resources on the host such as the operating system files.", "acronym": "HIDS"},
{"term": "Host-based intrusion prevention system. An extension of a host-based IDS. Designed to react in real time to catch an attack in action.", "acronym": "HIPS"},
{"term": "Hash-based Message Authentication Code. An HMAC is a fixed length string of bits similar to other hashing algorithms such as MD5 and SHA-1, but it also uses a secret key to add some randomness to the result.", "acronym": "HMAC"},
{"term": "Hardware security module. A removable or external device that can generate, store, and manage RSA keys used in asymmetric encryption. High-volume ecommerce sites use HSMs to increase the performance of SSL sessions. High-availability clusters needing encryption services can use clustered HSMs.", "acronym": "HSM"},
{"term": "Hypertext Markup Language. Language used to create web pages served on the Internet. HTML documents are displayed by web browsers and delivered over the Internet using HTTP or HTTPS. It uses less than and greater than characters (< and >) to create tags. Many sites use input validation to block these tags and prevent cross-site scripting attacks.", "acronym": "HTML"},
{"term": "Hypertext Transfer Protocol. Used for web traffic on the Internet and in intranets. HTTP uses port 80.", "acronym": "HTTP"},
{"term": "Hypertext Transfer Protocol Secure. Encrypts HTTP traffic with SSL or TLS using port 443.", "acronym": "HTTPS"},
{"term": "Heating, ventilation, and air conditioning. HVAC systems increase availability by regulating airflow within datacenters and server rooms. They use hot and cold to regulate the cooling, thermostats to ensure a relatively constant temperature, and humidity controls to reduce the potential for static discharges, and damage from condensation. They are often integrated with fire alarm systems and either have dampers or the ability to be turned off in the event of a fire.", "acronym": "HVAC"},
{"term": "Infrastructure as a Service. A cloud computing technology useful for heavily utilized systems and networks. Organizations can limit their hardware footprint and personnel costs by renting access to hardware such as servers. Compare to PaaS and SaaS.", "acronym": "IaaS"},
{"term": "Internet Control Message Protocol. Used for diagnostics such as ping. Many DoS attacks use ICMP. It is common to block ICMP at firewalls and routers. If ping fails, but other connectivity to a server succeeds, it indicates that ICMP is blocked.", "acronym": "ICMP"},
{"term": "Identification. For example, a protocol ID identifies a protocol based on a number. AH is identified with protocol ID number 51 and ESP is identified with protocol ID number 50.", "acronym": "ID"},
{"term": "Intrusion detection system. A detective control used to detect attacks after they occur. A signature-based IDS (also called definition-based) uses a database of predefined traffic patterns. An anomaly-based IDS (also called behavior-based) starts with a performance baseline of normal behavior and compares network traffic against this baseline. An IDS can be either host-based (HIDS) or network-based (NIDS). In contrast, a firewall is a preventative control that attempts to prevent the attacks before they occur. An IPS is a preventative control that will stop an attack in progress.", "acronym": "IDS"},
{"term": "Institute of Electrical and Electronic Engineers. International organization with a focus on electrical, electronics, and information technology topics. IEEE standards are well respected and followed by vendors around the world.", "acronym": "IEEE"},
{"term": "Internet Group Management Protocol. Used for multicasting. Computers belonging to a multicasting group have a multicasting IP address in addition to a standard unicast IP address.", "acronym": "IGMP"},
{"term": "Internet Information Services. A Microsoft Windows web server. IIS comes free with Microsoft Windows Server products.", "acronym": "IIS"},
{"term": "Internet Key Exchange. Used with IPsec to create a secure channel over port 500 in a VPN tunnel.", "acronym": "IKE"},
{"term": "Instant Messaging. Real-time direct text-based communication between two or more people, often referred to as chat.", "acronym": "IM"},
{"term": "Internet Message Access Protocol v4. Used to store e-mail on servers and allow clients to manage their e-mail on the server. IMAP4 uses port 143.", "acronym": "IMAP4"},
{"term": "Intrusion prevention system. A preventative control that will stop an attack in progress. It is similar to an active IDS except that it’s placed in line with traffic. An IPS can actively monitor data streams, detect malicious content, and stop attacks in progress.", "acronym": "IPS"},
{"term": "Internet Protocol Security. Used to encrypt traffic on the wire and can operate in both tunnel mode and transport mode. It uses tunnel mode for VPN traffic. IPsec is built into IPv6, but can also work with IPv4 and it includes both AH and ESP. AH provides authentication and integrity, and ESP provides confidentiality, integrity, and authentication. IPsec uses port 500 for IKE with VPN connections.", "acronym": "IPsec"},
{"term": "Internet Protocol version 4. Identifies hosts using a 32-bit IP address. IPv4 is expressed in dotted decimal format with decimal numbers separated by dots or periods like this: 192.168.1.1.", "acronym": "IPv4"},
{"term": "Internet Protocol version 6. Identifies hosts using a 128-bit address. IPv6 is expressed as eight groups of four hexadecimal characters (numbers and letters), such as this: FE80: 0000:0000:0000: 20D4:3FF7:003F:DE62.", "acronym": "IPv6"},
{"term": "Internet Relay Chat. A form of real-time Internet text messaging often used with chat sessions. Some botnets have used IRC channels to control zombie computers through a command and control server.", "acronym": "IRC"},
{"term": "Incident Response Team. A group of experts that respond to security incidents. Also known as CERT, CIRT, or SIRT.", "acronym": "IRT"},
{"term": "Internet Service Provider. Company that provides Internet access to customers.", "acronym": "ISP"},
{"term": "Initialization vector. An provides randomization of encryption keys to help ensure that keys are not reused. WEP was susceptible to IV attacks because it used relatively small IVs. In an IV attack, the attacker uses packet injection, increasing the number of packets to analyze, and discovers the encryption key.", "acronym": "IV"},
{"term": "Key Distribution Center. Part of the Kerberos protocol used for network authentication. The KDC issues time-stamped tickets that expire.", "acronym": "KDC"},
{"term": "Layer 2 Tunneling Protocol. Tunneling protocol used with VPNs. L2TP is commonly used with IPsec (L2TP/IPsec). L2TP uses port 1701.", "acronym": "L2TP"},
{"term": "Local area network. Group of hosts connected within a network.", "acronym": "LAN"},
{"term": "Local area network manager. Older authentication protocol used to provide backward compatibility to Windows 9x clients. LANMAN passwords are easily cracked due to how they are stored.", "acronym": "LANMAN"},
{"term": "Lightweight Directory Access Protocol. Language used to communicate with directories such as Microsoft’s Active Directory. It provides a central location to manage user accounts and other directory objects. LDAP uses port 389 when unencrypted and port 636 when encrypted.", "acronym": "LDAP"},
{"term": "Lightweight Extensible Authentication Protocol. A modified version of the Challenge Handshake Authentication Protocol (CHAP) created by Cisco.", "acronym": "LEAP"},
{"term": "Mandatory Access Control. Access control model that uses sensitivity labels assigned to objects (files and folders) and subjects (users). SELinux (deployed in both Linux and UNIX platforms) is a trusted operating system platform using the MAC model. Other access control models are DAC and RBAC.", "acronym": "MAC"},
{"term": "Media access control. A 48-bit address used to uniquely identify network interface cards. It also called a hardware address or a physical address, and is commonly displayed as six pairs of hexadecimal characters. Port security on a switch can limit access using MAC filtering. Wireless access points can use MAC filtering to restrict access to only certain clients, though an attacker can easily beat this.", "acronym": "MAC"},
{"term": "Message authentication code. Method used to provide integrity for messages. A MAC uses a secret key to encrypt the hash. Some versions called HMAC.", "acronym": "MAC"},
{"term": "Metropolitan area network. A computer network that spans a metropolitan area such as a city or a large campus", "acronym": "MAN"},
{"term": "Master Boot Record. An area on a hard disk in its first sector. When the BIOS boots a system, it looks at the MBR for instructions and information on how to boot the disk and load the operating system. Some malware tries to hide here.", "acronym": "MBR"},
{"term": "Message Digest 5. A hashing function used to provide integrity. MD5 uses 128 bits. A hash is simply a number created by applying the algorithm to a file or message at different times. The hashes are compared to each other to verify that integrity has been maintained.", "acronym": "MD5"},
{"term": "Man in the middle. A MITM attack is a form of active interception allowing an attacker to intercept traffic and insert malicious code sent to other clients. Kerberos provides mutual authentication and helps prevent MITM attacks.", "acronym": "MITM"},
{"term": "Microsoft Challenge Handshake Authentication Protocol. Microsoft’s implementation of CHAP. MS-CHAPv2 provides mutual authentication.", "acronym": "MS-CHAP"},
{"term": "Maximum Transmission Unit. The MTU identifies the size of data that can be transferred.", "acronym": "MTU"},
{"term": "Network access control. Inspects clients for health and can restrict network access to unhealthy clients to a remediation network. Clients run agents and these agents report status to a NAC server. NAC is used for VPN and internal clients. MAC filtering is a form of NAC.", "acronym": "NAC"},
{"term": "Network Address Translation. A service that translates public IP addresses to private and private IP addresses to public. It hides addresses on an internal network.", "acronym": "NAT"},
{"term": "Network-based intrusion detection system. IDS used to monitor a network. It can detect network-based attacks, such as smurf attacks. A NIDS cannot monitor encrypted traffic, and cannot monitor traffic on individual hosts.", "acronym": "NIDS"},
{"term": "Network-based intrusion prevention system. An IPS that monitors the network. An IPS can actively monitor data streams, detect malicious content, and stop attacks in progress.", "acronym": "NIPS"},
{"term": "National Institute of Standards and Technology. NIST is a part of the U.S. Department of Commerce, and it includes an Information Technology Laboratory (ITL). The ITL publishes special publications related to security that are freely available for download here: http://csrc.nist.gov/publications/PubsSPs.html.", "acronym": "NIST"},
{"term": "No operation, sometimes listed as NOP. NOOP instructions are often used in a buffer overflow attack. An attacker often writes a large number of NOOP instructions as a NOOP sled into memory, followed with malicious code.", "acronym": "NOOP"},
{"term": "Network Operating System. Software that runs on a server and enables the server to manage resources on a network.", "acronym": "NOS"},
{"term": "New Technology File System. A file system used in Microsoft operating systems that provides security. NTFS uses the DAC model.", "acronym": "NTFS"},
{"term": "New Technology LANMAN. Authentication protocol intended to improve LANMAN. The LANMAN protocol stores passwords using a hash of the password by first dividing the password into two seven-character blocks, and then converting all lowercase letters to uppercase. This makes LANMAN easy to crack. NTLM stores passwords in LANMAN format for backward compatibility, unless the passwords are greater than fifteen characters. NTLMv1 is older and has known vulnerabilities. NTLMv2 is newer and secure.", "acronym": "NTLM"},
{"term": "Network Time Protocol. Protocol used to synchronize computer times.", "acronym": "NTP"},
{"term": "Operating system. For example, SELinux is a trusted OS that can help prevent malicious code from executing.", "acronym": "OS"},
{"term": "Open Vulnerability Assessment Language. International standard proposed for vulnerability assessment scanners to follow.", "acronym": "OVAL"},
{"term": "Peer-to-peer. P2P applications allow users to share files such as music, video, and data over the Internet. Data leakage occurs when users install P2P software and unintentionally share files. Organizations often block P2P software at the firewall and detect running software with port scans.", "acronym": "P2P"},
{"term": "Platform as a Service. Provides cloud customers with an easy-to-configure operating system and on-demand computing capabilities. Compare to IaaS and SaaS.", "acronym": "PaaS"},
{"term": "Password Authentication Protocol. An older authentication protocol where passwords are sent across the network in clear text. Rarely used today.", "acronym": "PAP"},
{"term": "Port Address Translation. A form of network address translation.", "acronym": "PAT"},
{"term": "Private Branch Exchange. A telephone switch used to telephone calls.", "acronym": "PBX"},
{"term": "Protected Extensible Authentication Protocol. PEAP provides an extra layer of protection for EAP. PEAP-TLS uses TLS to encrypt the authentication process by encapsulating and encrypting the EAP conversation in a Transport Layer Security (TLS) tunnel. Since TLS requires a certificate, PEAP-TLS requires a certification authority (CA) to issue certificates.", "acronym": "PEAP"},
{"term": "Personal Electronic Device. Small devices such as cell telephones, radios, CD players, DVD players, video cameras, and MP3 players.", "acronym": "PED"},
{"term": "Pretty Good Privacy. Commonly used to secure e-mail communications between two private individuals but is also used in companies. It provides confidentiality, integrity, authentication, and non-repudiation. It can digitally sign and encrypt e-mail. It uses both asymmetric and symmetric encryption.", "acronym": "PGP"},
{"term": "Personally Identifiable Information. Information about individuals that can be used to trace a person’s identity, such as a full name, birthdate, biometric data, and identifying numbers such as a Social Security number (SSN). Organizations have an obligation to protect PII and often identify procedures for handling and retaining PII in data policies.", "acronym": "PII"},
{"term": "Personal identification number. A number known by a user and entered for authentication. PINs are often combined with smart cards to provide two-factor authentication.", "acronym": "PIN"},
{"term": "Personal identity verification card. A specialized type of smart card used by United States federal agencies. It includes photo identification and provides confidentiality, integrity, authentication, and non-repudiation for the users. It is similar to a CAC.", "acronym": "PIV"},
{"term": "Public Key Infrastructure. Group of technologies used to request, create, manage, store, distribute, and revoke digital certificates. Certificates are an important part of asymmetric encryption. Certificates include public keys along with details on the owner of the certificate and on the CA that issued the certificate. Certificate owners share their public key by sharing a copy of their certificate.", "acronym": "PKI"},
{"term": "Post Office Protocol v3. Used to transfer e-mail from mail servers to clients. POP3 uses port 110.", "acronym": "POP3"},
{"term": "Plain old telephone service. Voice grade telephone service available.", "acronym": "POTS"},
{"term": "Point-to-Point Protocol. Used to create remote access connections.", "acronym": "PPP"},
{"term": "Point-to-Point Tunneling Protocol. Tunneling protocol used with VPNs. PPTP uses TCP port 1723.", "acronym": "PPTP"},
{"term": "Pre-shared key. A secret shared among different systems. Wireless networks support Personal Mode, where each device uses the same PSK. In contrast, Enterprise Mode uses an 802.1x or RADIUS server for authentication.", "acronym": "PSK"},
{"term": "Pan tilt zoom. Refers to cameras that can pan (move left and right), tilt (move up and down), and zoom to get a closer or a wider view.", "acronym": "PTZ"},
{"term": "Recovery agent. A designated individual who can recover or restore cryptographic keys. In the context of a PKI, a recovery agent can recover private keys to access encrypted data.", "acronym": "RA"},
{"term": "Remote Authentication Dial-In User Service. Provides central authentication for remote access clients. RADIUS encrypts the password packets and uses UDP. In contrast, TACACS+ encrypts the entire authentication process and uses TCP.", "acronym": "RADIUS"},
{"term": "Redundant Array of Inexpensive (or Independent) Disks. Multiple disks added together to increase performance or provide protection against faults.", "acronym": "RAID"},
{"term": "Disk striping. RAID-0 improves performance but does not provide fault tolerance.", "acronym": "RAID-0"},
{"term": "Disk mirroring. RAID-1 uses two disks and provides fault tolerance.", "acronym": "RAID-1"},
{"term": "Disk striping with parity. RAID-5 uses three or more disks and provides fault tolerance.", "acronym": "RAID-5"},
{"term": "Random Access Memory. Volatile memory within a computer that holds active processes, data, and applications. Data in RAM is lost when the computer is turned off. Inspection of RAM can discover hooked processes from rootkits. Memory forensics analyzes data in RAM.", "acronym": "RAM"},
{"term": "Remote Access Service. A server used to provide access to an internal network from an outside location. RAS is also known as Remote Access Server and sometimes referred to as Network Access Service (NAS).", "acronym": "RAS"},
{"term": "Role-based access control. An access control model that uses roles to define access and it is often implemented with groups. A user account is placed into a role, inheriting the rights and permissions of the role. Other access control models are MAC and DAC.", "acronym": "RBAC"},
{"term": "Rule-based access control. An access control model that uses rules to define access. Rule-based access control is based on a set of approved instructions, such as an access control list. Other access control models are MAC and DAC.", "acronym": "RBAC"},
{"term": "Ron’s Code or Rivest’s Cipher. Symmetric encryption algorithm that includes versions RC2, RC4, RC5, and RC6. RC4 is a secure stream cipher, and RC5 and RC6 are block ciphers.", "acronym": "RC"},
{"term": "Radio frequency interference. Interference from RF sources such as AM or FM transmitters. RFI can be filtered to prevent data interference, and cables can be shielded to protect signals from RFI.", "acronym": "RFI"},
{"term": "RACE Integrity Primitives Evaluation Message Digest. A hash function used for integrity. It creates fixed length hashes of 128, 160, 256, or 320 bits.", "acronym": "RIPEMD"},
{"term": "Recovery Point Objective. A Recovery Point Objective identifies a point in time where data loss is acceptable. It is related to the RTO and the BIA often includes both RTOs and RPOs.", "acronym": "RPO"},
{"term": "An asymmetric algorithm used to encrypt data and digitally sign transmissions. It is named after its creators, Rivest, Shamir, and Adleman, and RSA is also the name of the company they founded together. RSA relies on the mathematical properties of prime numbers when creating public and private keys.", "acronym": "RSA"},
{"term": "Rapid Spanning Tree Protocol. An improvement over STP. STP and RSTP protocols are enabled on most switches and protect against switching loops, such as those caused when two ports of a switch are connected together.", "acronym": "RSTP"},
{"term": "Recovery Time Objective. An RTO identifies the maximum amount of time it can take to restore a system after an outage. It is related to the RPO and the BIA often includes both RTOs and RPOs.", "acronym": "RTO"},
{"term": "Real-time Transport Protocol. A standard used for delivering audio and video over an IP network.", "acronym": "RTP"},
{"term": "Secure/Multipurpose Internet Mail Extensions. Used to secure e-mail. S/MIME provides confidentiality, integrity, authentication, and non-repudiation. It can digitally sign and encrypt e-mail, including the encryption of e-mail at rest (stored on a drive) and in transit (data sent over the network). It uses RSA, with public and private keys for encryption and decryption, and depends on a PKI for certificates.", "acronym": "S/MIME"},
{"term": "Software as a Service. Applications provided over the Internet. Webmail is an example of a cloud-based technology. Compare to IaaS and PaaS.", "acronym": "SaaS"},
{"term": "Security Content Automation Protocol. A method with automated vulnerability management, measurement, and policy compliance evaluation tools", "acronym": "SCAP"},
{"term": "Secure copy. Based on SSH, SCP allows users to copy encrypted files over a network. SCP uses port 22.", "acronym": "SCP"},
{"term": "Small Computer System Interface. Set of standards used to connect peripherals to computers. Commonly used for SCSI hard disks and/or tape drives.", "acronym": "SCSI"},
{"term": "Software Development Life Cycle. A software development process. Many different models are available.", "acronym": "SDLC"},
{"term": "Software Development Life Cycle Methodology. The practice of using a SDLC when developing applications.", "acronym": "SDLM"},
{"term": "Security-Enhanced Linux. A trusted operating system platform that prevents malicious or suspicious code from executing on both Linux and UNIX systems. It is one of the few operating systems that use the MAC model.", "acronym": "SELinux"},
{"term": "Secure FTP. An extension of Secure Shell (SSH) using SSH to transmit the files in an encrypted format. SFTP transmits data using port 22.", "acronym": "SFTP"},
{"term": "Secure Hash Algorithm. A hashing function used to provide integrity. SHA1 uses 160 bits, and SHA-256 uses 256 bits. Hashing algorithms always provide a fixed-size bit-string regardless of the size of the hashed data. By comparing the hashes at two different times, you can verify integrity of the data.", "acronym": "SHA"},
{"term": "Secure Hypertext Transfer Protocol. An alternative to HTTPS. Infrequently used.", "acronym": "SHTTP"},
{"term": "Security identifier. Unique set of numbers and letters used to identify each user and each group in Microsoft environments.", "acronym": "SID"},
{"term": "Subscriber Identity Module. A small smart card that contains programming and information for small devices such as cell phones.", "acronym": "SIM"},
{"term": "Security Incident Response Team. A group of experts that respond to security incidents. Also known as CERT, CERT, or IRT.", "acronym": "SIRT"},
{"term": "Service level agreement. An agreement between a company and a vendor that stipulates performance expectations, such as minimum uptime and maximum downtime levels.", "acronym": "SLA"},
{"term": "Single loss expectancy. Used to measure risk with annualized loss expectancy (ALE) and annualized rate of occurrence (ARO). The SLE identifies the expected dollar amount for a single event resulting in a loss. The calculation is SLE x ARO = ALE.", "acronym": "SLE"},
{"term": "Simple Mail Transfer Protocol. Used to transfer e-mail between clients and servers and between e-mail servers and other e-mail servers. SMTP uses port 25.", "acronym": "SMTP"},
{"term": "Simple Network Management Protocol. Used to manage network devices such as routers or switches. SNMP agents report information via notifications known as SNMP traps, or SNMP device traps.", "acronym": "SNMP"},
{"term": "Synchronous Optical Network Technologies. A multiplexing protocol used to transfer data over optical fiber.", "acronym": "SONET"},
{"term": "Spam over Internet Messaging. A form of spam using instant messaging that targets instant messaging users", "acronym": "SPIM"},
{"term": "Single point of failure. An SPOF is any component whose failure results in the failure of an entire system. Elements such as RAID, failover clustering, UPS, and generators remove many single points of failure.", "acronym": "SPOF"},
{"term": "Structured query language. Used by SQL-based databases, such as Microsoft’s SQL Server. Websites integrated with a SQL database are subject to SQL injection attacks. Input validation with forms and stored procedures help prevent SQL injection attacks. Microsoft’s SQL Server uses port 1433 by default.", "acronym": "SQL"},
{"term": "Secure Shell. SSH encrypts a wide variety of traffic such as Secure File Transfer Protocol (SFTP), Telnet, and Secure Copy (SCP). SSH uses port 22.", "acronym": "SSH"},
{"term": "Service Set Identifier. Identifies the name of a wireless network. Disabling SSID broadcast can hide the network from casual users but an attacker can easily discover it with a wireless sniffer. It’s recommended to change the SSID from the default name.", "acronym": "SSID"},
{"term": "Secure Sockets Layer. Used to encrypt traffic on the wire. SSL is used with HTTPS to encrypt HTTP traffic on the Internet using both symmetric and asymmetric encryption algorithms. SSL uses port 443 when encrypting HTTPS traffic.", "acronym": "SSL"},
{"term": "Single sign-on. Authentication method where users can access multiple resources on a network using a single account. SSO can provide central authentication against a federated database for different operating systems.", "acronym": "SSO"},
{"term": "Secure Socket Tunneling Protocol. A tunneling protocol that encrypts VPN traffic using SSL over port 443.", "acronym": "SSTP"},
{"term": "Spanning Tree Protocol. Protocol enabled on most switches that protects against switching loops. A switching loop can be caused if two ports of a switch are connected together, such as those caused when two ports of a switch are connected together.", "acronym": "STP"},
{"term": "Shielded twisted pair. Cable type used in networks that includes shielding to prevent interference from EMI and RFI. It can also prevent data from emanating outside the cable.", "acronym": "STP"},
{"term": "Synchronize. The first packet in a TCP handshake. In a SYN flood attack, attackers send this packet, but don’t complete the handshake after receiving the SYN/ACK packet. A flood guard is a logical control that protects against SYN flood attacks.", "acronym": "SYN"},
{"term": "Terminal Access Controller Access-Control System. An older remote authentication protocol that was commonly used in UNIX networks. TACACS+ is more commonly used.", "acronym": "TACACS"},
{"term": "Terminal Access Controller Access-Control System+. Provides central authentication for remote access clients and used as an alternative to RADIUS. TACACS+ uses TCP port 49, compared with TACACS, which uses UDP port 49. It encrypts the entire authentication process, compared with RADIUS, which only encrypts the password. It uses multiple challenges and responses.", "acronym": "TACACS+"},
{"term": "Total cost of ownership. A factor considered when purchasing new products and services. TCO attempts to identify the cost of a product or service over its lifetime.", "acronym": "TCO"},
{"term": "Transmission Control Protocol. Provides guaranteed delivery of IP traffic using a three-way handshake.", "acronym": "TCP"},
{"term": "Transmission Control Protocol/Internet Protocol. Represents the full suite of protocols.", "acronym": "TCP/IP"},
{"term": "Trivial File Transfer Protocol. Used to transfer small amounts of data with UDP port 69. In contrast, FTP is used to transfer larger files using TCP ports 20 and 21.", "acronym": "TFTP"},
{"term": "Temporal Key Integrity Protocol. Wireless security protocol introduced to address the problems with WEP. TKIP was used with WPA but many implementations of WPA now support CCMP.", "acronym": "TKIP"},
{"term": "Transport Layer Security. Used to encrypt traffic on the wire. TLS is the replacement for SSL and like SSL, it uses certificates issued by CAs. PEAP-TLS uses TLS to encrypt the authentication process and PEAP-TLS requires a CA to issue certificates.", "acronym": "TLS"},
{"term": "Trusted Platform Module. This is a hardware chip on the motherboard included on many newer laptops. A TPM includes a unique RSA asymmetric key, and it can generate and store other keys used for encryption, decryption, and authentication. TPM provides full disk encryption.", "acronym": "TPM"},
{"term": "User Acceptance Testing. One of the last phases of testing an application before its release.", "acronym": "UAT"},
{"term": "User Datagram Protocol. Used instead of TCP when guaranteed delivery of each packet is not necessary. UDP uses a best-effort delivery mechanism.", "acronym": "UDP"},
{"term": "Uninterruptible power supply. A battery backup system that provides fault tolerance for power and can protect against power fluctuations. UPS provide short-term power giving the system enough time to shut down smoothly, or to transfer to generator power. Generators provide long-term power in extended outages.", "acronym": "UPS"},
{"term": "Universal Resource Locator. Address used to access web resources, such as http://GetCertifiedGetAhead.com. Pop-up blockers can include URLs of sites where pop-ups are allowed.", "acronym": "URL"},
{"term": "Universal Serial Bus. A serial connection used to connect peripherals such as printers, flash drives, and external hard disk drives. Data on USB drives can be protected against loss of confidentiality with encryption. They combine high volume and transfer speeds with ease of concealment and often result in data leakage.", "acronym": "USB"},
{"term": "Unshielded twisted pair. Cable type used in networks that do not have any concerns over EMI, RFI, or cross talk. If these are a concern, STP is used.", "acronym": "UTP"},
{"term": "Virtual local area network. A VLAN can logically group several different computers together, or logically separate computers, without regard to their physical location. It is possible to create multiple VLANs with a single switch.", "acronym": "VLAN"},
{"term": "Virtual machine. A virtual system hosted on a physical system. A physical server can host multiple VMs as servers. Virtualization can reduce the footprint of an organization’s server room or datacenter, and helps eliminate wasted resources. It also helps reduce the amount of physical equipment, reducing overall physical security requirements. A VM escape is an attack that allows an attacker to access the host system from within the virtual system.", "acronym": "VM"},
{"term": "Voice over IP. A group of technologies used to transmit voice over IP networks. Vishing is a form of phishing that sometimes uses VoIP.", "acronym": "VoIP"},
{"term": "Virtual private network. Provides access to a private network over a public network such as the Internet. VPN concentrators provide VPN access to large groups of users.", "acronym": "VPN"},
{"term": "Video teleconferencing. A group of interactive telecommunication technologies that allow people in two or more locations to interact with two-way video and audio transmissions.", "acronym": "VTC"},
{"term": "", "acronym": "W"},
{"term": "Wireless access point, sometimes just called an access point (AP). Increasing the power level of a WAP increases the wireless coverage of the WAP. Decreasing the power levels, decreases the coverage. Coverage can also be manipulated by moving or positioning the wireless antenna.", "acronym": "WAP"},
{"term": "Wired Equivalent Privacy. Original wireless security protocol. Had significant security flaws and was replaced with WPA, and ultimately WPA2. WEP used RC4 incorrectly making it susceptible to IV attacks.", "acronym": "WEP"},
{"term": "Wireless intrusion detection system. An IDS used for wireless networks.", "acronym": "WIDS"},
{"term": "Wireless intrusion prevention system. An IPS used for wireless networks.", "acronym": "WIPS"},
{"term": "Wireless local area network. Network connected wirelessly.", "acronym": "WLAN"},
{"term": "Wi-Fi Protected Access. Replaced WEP as a wireless security protocol without replacing hardware. Superseded by WPA2.", "acronym": "WPA"},
{"term": "Wi-Fi Protected Access version 2. Newer security protocol used to protect wireless transmissions. It supports CCMP for encryption, which is based on AES and stronger than TKIP which was originally released with WPA. In Enterprise Mode, it can use RADIUS to support 802.1x authentication. In personal mode, it uses a preshared key (PSK).", "acronym": "WPA2"},
{"term": "Wireless Transport Layer Security. Used to encrypt traffic for smaller wireless devices.", "acronym": "WTLS"},
{"term": "Extensible markup language. Used by many databases for inputting or exporting data. XML uses formatting rules to describe the data.", "acronym": "XML"},
{"term": "Extended Terminal Access Controller Access-Control System. An improvement over TACACS developed by Cisco Systems and proprietary to Cisco systems. TACACS+ is more commonly used.", "acronym": "XTACACS"},
{"term": "Cross-site request forgery. An attack that causes users to perform actions on websites without their knowledge. In some cases, attackers use header manipulation to steal cookies and harvest passwords.", "acronym": "XSRF"},
{"term": "Cross-site scripting. It scripting allows an attacker to redirect users to malicious websites and steal cookies. E-mail can include an embedded HTML image object or a JavaScript image tag as part of a malicious cross-site scripting attack. Websites prevent cross-site scripting attacks with input validation to detect and block input that include HTML and JavaScript tags. Many sites prevent the use of < and > characters to block cross-site scripting.", "acronym": "XSS"}
]